//static int g_val=2019;//static修饰全局变量，修改了全局变量的作用域，仅能在自己的源文件内部使用
//
//static int Add(int x,int y){//static修饰函数，改变了函数的作用域
//
//	return x+y;
//}
                       // 行数    个数
//*                      1        1=行数*2-1
//***                    2        3
//*****                  3        5 
//*******                4        7
//*********              5        9
//***********            6        11
//*************          7        13=行数*2-1
//***********            6        11
//*********              5        9
//*******                4        7
//*****                  3        5
//***                    2        3
//*                      1        1

//#include <stdio.h>
//#include <stdlib.h>
//int main(){
//	int rows=1;
//	int num=0;
//	for (rows=1;rows<=7;rows++)
//	{
//		for (num=0;num<rows*2-1;num++)
//		{
//			printf("*");
//		}
//		printf("\n");
//         
//	}
//	for (rows=6;rows>=1;rows--)
//	{
//		for (num=0;num<rows*2-1;num++)
//		{
//			printf("*");
//		}
//		printf("\n");
//
//	}
//
//    
//	system("pause");
//	return 0;
//}








//2.求出0～999之间的所有“水仙花数”并输出。 
//“水仙花数”是指一个三位数，其各位数字的立方和确好等于该数本身，如；153＝1＋5＋3?，则153是//
//一个“水仙花数”。 

/* 
在数论中，水仙花数（Narcissistic number）也称为自恋数、自幂数、阿姆斯壮数或阿姆斯特朗数
（Armstrong number），是指一N位数，其各个数之N次方和等于该数。 
例如153、370、371及407就是三位数的水仙花数，其各个数之立方和等于该数： 
153 = 1^3 + 5^3 + 3^3。 
370 = 3^3 + 7^3 + 0^3。 
371 = 3^3 + 7^3 + 1^3。 
407 = 4^3 + 0^3 + 7^3。 
*/ 


//#include <stdio.h>
//#include<stdlib.h>
//#include<math.h>
//int main(){
//    int i=0;
//	int count=0;
//	for (i=0;i<=999;i++)
//	{
//		if (i/100>=1)//先判断是否为三位数
//		{
//			//如果是3位数的话，再判断是否为水仙花数
//			if( i==pow(i/100,3)+pow(i%100/10,3) +pow((i%10),3))
//			{   count++;
//			printf("%d ",i);
//			}
//		}
//		
//	}
//	printf("\n0-999中水仙花数的个数为：%d ",count);
//	
//	system("pause");
//	return 0;
//}







/*求Sn=a+aa+aaa+aaaa+aaaaa的前5项之和，其中a是一个数字， 
例如：2+22+222+2222+22222*/ 
